Revit 2027 API
ApplicationEntryPoint Class
For Revit Macros use only.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.ApplicationServices.Application
 Autodesk.Revit.DB.Macros.ApplicationEntryPoint
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ApplicationEntryPoint : Application,
	IEntryPoint
Public MustInherit Class ApplicationEntryPoint
	Inherits Application
	Implements IEntryPoint
public ref class ApplicationEntryPoint abstract : public Application,
	IEntryPoint
[<AbstractClassAttribute>]
type ApplicationEntryPoint =
    class
        inherit Application
        interface IEntryPoint
    end
The ApplicationEntryPoint type exposes the following members.
Constructors
Name | Description
ApplicationEntryPoint | Initializes a new instance of the ApplicationEntryPoint class
Top
Properties
Name | Description
ActiveAddInId | Retrieves the Id of the currently running external application.
(Inherited from Application)
AddinFolder |  The full path to the Revit Macros module.
AllowNavigationDuringRedraw |  Checks whether or not the navigation during redraw is enabled, and enable or disable it.
(Inherited from Application)
AllUsersAddinsLocation |  The folder location for .addin files for all users.
(Inherited from Application)
AngleTolerance |  Angle tolerance.
(Inherited from Application)
BackgroundColor |  The background color to use for model views in this session.
(Inherited from Application)
Cities | Returns a set of all the known city locations within Revit.
(Inherited from Application)
Create | Provides an object that can be used to create new instances of Autodesk Revit API objects.
(Inherited from Application)
CurrentRevitServerAccelerator |  Current Revit Server accelerator.
(Inherited from Application)
CurrentUserAddinsLocation |  The folder location for .addin files for the current user.
(Inherited from Application)
CurrentUsersAddinsDataFolderPath |  Path to AddinsData folder for the current user.
(Inherited from Application)
CurrentUsersDataFolderPath |  Path to data folder for the current user.
(Inherited from Application)
DefaultIFCProjectTemplate |  Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
(Inherited from Application)
DefaultProjectTemplate |  Full path to the default template file for new project documents.
(Inherited from Application)
DefaultViewDiscipline |  The view discipline that will be applied to new views by default.
(Inherited from Application)
Documents |  Returns a set of documents within Revit.
(Inherited from Application)
ExportIFCCategoryTable |  Full path to the file that defines Revit category to IFC entity mappings for IFC export.
(Inherited from Application)
FamilyTemplatePath |  Default path for family template files.
(Inherited from Application)
ImportIFCCategoryTable |  Full path to the file that defines IFC entity to Revit category mappings for IFC import.
(Inherited from Application)
IsArchitectureEnabled |  Checks whether or not the architecture discipline is enabled, and enable or disable it.
(Inherited from Application)
IsConcreteEnabled |  Checks whether or not the concrete discipline is enabled, and enable or disable it.
(Inherited from Application)
IsElectricalAnalysisEnabled |  Checks whether or not electrical analysis is enabled, and enable or disable it.
(Inherited from Application)
IsElectricalEnabled |  Checks whether or not the electrical discipline is enabled, and enable or disable it.
(Inherited from Application)
IsEnergyAnalysisEnabled |  Checks whether or not energy analysis is enabled, and enable or disable it.
(Inherited from Application)
IsInfrastructureEnabled |  Checks whether or not infrastructure discipline is enabled, and enable or disable it.
(Inherited from Application)
IsMassingEnabled |  Checks whether or not the massing and site tools are enabled, and enable or disable them.
(Inherited from Application)
IsMechanicalAnalysisEnabled |  Checks whether or not mechanical analysis is enabled, and enable or disable it.
(Inherited from Application)
IsMechanicalEnabled |  Checks whether or not the mechanical discipline is enabled, and enable or disable it.
(Inherited from Application)
IsPipingAnalysisEnabled |  Checks whether or not piping analysis is enabled, and enable or disable it.
(Inherited from Application)
IsPipingEnabled |  Checks whether or not the piping discipline is enabled, and enable or disable it.
(Inherited from Application)
IsPrecastEnabled |  Checks whether or not the precast is enabled, and enable or disable it.
(Inherited from Application)
IsRouteAnalysisEnabled |  Checks whether or not route analysis is enabled, and enable or disable it.
(Inherited from Application)
IsStructuralAnalysisEnabled |  Checks whether or not the structural analysis is enabled, and enable or disable it.
(Inherited from Application)
IsStructureEnabled |  Checks whether or not the structure discipline is enabled, and enable or disable it.
(Inherited from Application)
IsSystemsEnabled |  Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
(Inherited from Application)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Application)
Language | The language used in the current session of Revit.
(Inherited from Application)
LoginUserId |  The user id of the user currently logged in. The user id will be empty if the user is not logged in.
(Inherited from Application)
PointCloudsRootPath |  Root path for point cloud files.
(Inherited from Application)
Product |  The product type for the current session of Revit.
(Inherited from Application)
RecordingJournalFilename |  Retrieve the name of the journal file the Revit is currently recording to.
(Inherited from Application)
SharedComponentsLocation |  Location of shared components used by Revit.
(Inherited from Application)
SharedParametersFilename | Contains the fully qualified path to a shared parameters file.
(Inherited from Application)
ShortCurveTolerance |  The enforced minimum length for any curve created by Revit.
(Inherited from Application)
ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects |  Whether or not to show the graphical open ends for Area Based Load Boundary disconnects.
(Inherited from Application)
ShowGraphicalWarningCableTrayConduitDisconnects |  Whether or not to show the graphical warnings for CTC disconnects.
(Inherited from Application)
ShowGraphicalWarningDuctDisconnects |  Whether or not to show the graphical warnings for duct disconnects.
(Inherited from Application)
ShowGraphicalWarningElectricalDisconnects |  Whether or not to show the graphical warnings for Electrical disconnects.
(Inherited from Application)
ShowGraphicalWarningHangerDisconnects |  Whether or not to show the graphical warnings for Fabrication Hanger disconnects.
(Inherited from Application)
ShowGraphicalWarningPipeDisconnects |  Whether or not to show the graphical warnings for Pipe disconnects.
(Inherited from Application)
SubVersionNumber |  The minor version number of Revit
(Inherited from Application)
SystemsAnalysisWorkfilesRootPath |  Root path for systems analysis workfiles
(Inherited from Application)
Username |  Gets the user name for the current Revit session.
(Inherited from Application)
VersionBuild |  Returns the internal build number of the Autodesk Revit application.
(Inherited from Application)
VersionName |  Returns the name of the Revit application.
(Inherited from Application)
VersionNumber |  Return the primary version of the Revit application.
(Inherited from Application)
VertexTolerance |  Vertex tolerance.
(Inherited from Application)
Top
Methods
Name | Description
CopyModel |  Copies an existing model to a new file. Overwriting a file of the same name is allowed.
(Inherited from Application)
Dispose
(Inherited from Application)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
ExtractPartAtomFromFamilyFile |  Writes a PartAtom XML from the contents of a family file.
(Inherited from Application)
FinishInitializationEO |  For Revit Macros internal use only.
GetAssets |  Gets all the Assets of the specified type.
(Inherited from Application)
GetExtendedApiService<TService>
(Inherited from Application)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLibraryPaths |  Returns path information identifying where Revit searches for content.
(Inherited from Application)
GetRevitServerNetworkHosts |  Gets the list of all Revit Server Network hosts in current session.
(Inherited from Application)
GetSystemsAnalysisWorkflowNames |  Returns names for systems analysis workflows.
(Inherited from Application)
GetSystemsAnalysisWorkflows |  Returns name and path information identifying systems analysis workflow files.
(Inherited from Application)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetWorksharingCentralGUID |  Gets the worksharing central GUID of the given server-based model.
(Inherited from Application)
Initialize |  For Revit Macros internal use only.
IsJournalPlaying |  Determines if the application is currently in journal playback mode.
(Inherited from Application)
NewFamilyDocument |  New family document, including family, titleblock, and annotation symbol
(Inherited from Application)
NewProjectDocument(String) |  New project document
(Inherited from Application)
NewProjectDocument(UnitSystem) |  Creates a new project document with no template file specified.
(Inherited from Application)
NewProjectTemplateDocument |  New project template document
(Inherited from Application)
OnShutdownEO |  For Revit Macros internal use only.
OpenDocumentFile(String) |  Opens a document from disk.
(Inherited from Application)
OpenDocumentFile(ModelPath, OpenOptions) |  Opens a document from disk or cloud.
(Inherited from Application)
OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) |  Opens a document from disk or cloud.
(Inherited from Application)
OpenIFCDocument(String) |  Opens an IFC document from disk using default options.
(Inherited from Application)
OpenIFCDocument(String, IFCImportOptions) |  Opens an IFC document from disk using custom options.
(Inherited from Application)
OpenSharedParameterFile | Enables access to shared parameter groups and definitions that are maintained on disk.
(Inherited from Application)
PurgeReleasedAPIObjects |  Explicitly purges all API objects that have been released but are still awaiting to be finalized
(Inherited from Application)
SetLibraryPaths |  Sets path information identifying where Revit searches for content.
(Inherited from Application)
SetSystemsAnalysisWorkflows |  Sets name and path information identifying systems analysis workflow files.
(Inherited from Application)
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateRenderAppearanceLibrary |  Updates the stored render appearance library, giving the Revit session access to any new RPC content.
(Inherited from Application)
WriteJournalComment |  Writes a comment to the Revit journal file.
(Inherited from Application)
Top
Events
Name | Description
ApplicationInitialized |  Subscribe to this event to get notified after the Revit application has been initialized
(Inherited from Application)
DocumentChanged |  Subscribe to the DocumentChanged event to be notified when Revit document has changed.
(Inherited from Application)
DocumentClosed |  Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
(Inherited from Application)
DocumentClosing |  Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
(Inherited from Application)
DocumentCreated |  Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document.
(Inherited from Application)
DocumentCreating |  Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document.
(Inherited from Application)
DocumentOpened |  Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document.
(Inherited from Application)
DocumentOpening |  Subscribe to the DocumentOpening event to be notified when Revit is just about to open a document.
(Inherited from Application)
DocumentPrinted |  Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
(Inherited from Application)
DocumentPrinting |  Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
(Inherited from Application)
DocumentReloadedLatest |  Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model.
(Inherited from Application)
DocumentReloadingLatest |  Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.
(Inherited from Application)
DocumentSaved |  Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
(Inherited from Application)
DocumentSavedAs |  Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
(Inherited from Application)
DocumentSaving |  Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
(Inherited from Application)
DocumentSavingAs |  Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
(Inherited from Application)
DocumentSynchronizedWithCentral |  Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
(Inherited from Application)
DocumentSynchronizingWithCentral |  Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
(Inherited from Application)
DocumentWorksharingEnabled |  Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared.
(Inherited from Application)
ElementTypeDuplicated |  Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
(Inherited from Application)
ElementTypeDuplicating |  Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
(Inherited from Application)
FailuresProcessing |  Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
(Inherited from Application)
FamilyLoadedIntoDocument |  Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
(Inherited from Application)
FamilyLoadingIntoDocument |  Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
(Inherited from Application)
FileExported |  Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
(Inherited from Application)
FileExporting |  Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.
(Inherited from Application)
FileImported |  Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API.
(Inherited from Application)
FileImporting |  Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.
(Inherited from Application)
LinkedResourceOpened |  Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
(Inherited from Application)
LinkedResourceOpening |  Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
(Inherited from Application)
ProgressChanged |  Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
(Inherited from Application)
ViewExported |  Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document.
(Inherited from Application)
ViewExporting |  Subscribe to the ViewExporting event to be notified when Revit is just about to export a view of the document.
(Inherited from Application)
ViewPrinted |  Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
(Inherited from Application)
ViewPrinting |  Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
(Inherited from Application)
ViewsExportedByContext |  Subscribe to the ViewsExportedByContext event to be notified immediately after Revit has finished exporting one or more views of the document via an export context by CustomExporter.
(Inherited from Application)
ViewsExportingByContext |  Subscribe to the ViewsExportingByContext event to be notified when Revit is just about to export one or more views of the document via an export context by CustomExporter.
(Inherited from Application)
WorksharedOperationProgressChanged |  Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
(Inherited from Application)
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace